---
- example: 'Description    : uCPE-OS Hw: Unknown, Sw: 5.0.0.508'
  getval: |
    (?x)  # allows to write the regex in multi-lines
    Description\s+:\s(?P<description>\S+)
    \sHw:\s(?P<hw_ver>\S+),
    \sSw:\s(?P<sw_ver>\S+)
#  getval: 'Description\s+:\s(?P<description>\S+)\sHw:\s(?P<hw_ver>\S+),\sSw:\s(?P<sw_ver>\S+)'
  result:
    description: "{{ description }}"
    hardware_version: "{{ hw_ver }}"
    software_version: "{{ sw_ver }}"

- example: 'Name           : uCPE-OS'
  getval: 'Name\s+:\s(?P<name>.*)'
  result:
    name: "{{ name | trim }}"

- example: 'Model          : etx2v'
  getval: 'Model\s+:\s(?P<model>\S+)'
  result:
    model: "{{ model }}"

- example: 'Location       : The location of this device'
  getval: 'Location\s+:\s(?P<location>.*)'
  result:
    location: "{{ location | trim }}"

- example: 'Contact        : Name of contact person'
  getval: 'Contact\s+:\s(?P<contact>.*)'
  result:
    contact: "{{ contact | trim }}"

- example: 'MAC Address    : 00-08-A2-0C-BB-F5'
  getval: 'MAC Address\s+:\s(?P<mac>\S+)'
  result:
    mac_address: "{{ mac }}"
                                                                                                          
- example: 'Engine Time    : 44 days, 09:12:02'
  getval: 'Engine Time\s+:\s(?P<up_time>.*)'
  result:
    up_time: "{{ up_time | trim }}"

- example: 'Manufacturer Serial Number : Not Available'
  getval: 'Manufacturer Serial Number\s+:\s(?P<man_sn>.*)'
  result:
    manufacturer_serial_number: "{{ man_sn | trim }}"

- example: 'Connectors Side            : Front'
  getval: 'Connectors Side\s+:\s(?P<con_side>\S+)'
  result:
    connectors_side: "{{ con_side }}"                                                                                                                   

- example: 'Zero Touch Model     : --'
  getval: 'Zero Touch Model\s+:\s(?P<zt_model>\S+)'
  result:
    zero_touch_model: "{{ zt_model }}"
